app/Controllers/AuthController.php

    public function processForgotPassword()
    {
        $email = $this->request->getPost('email');
        $userModel = new UserModel();

        // Check if the email exists in the database
        $user = $userModel->where('email', $email)->first();

        if (!$user) {
            return redirect()->back()->with('error', 'Email not found.');
        }

        // Generate a secure reset token
        $resetToken = bin2hex(random_bytes(16));

        // Save the reset token to the database
        $userModel->update($user['id'], ['reset_token' => $resetToken]);
---
SELECT *
FROM `users`
WHERE `email` = 'bomm1squad2@gmail.com'
 LIMIT 1
UPDATE `users` SET `reset_token` = '15d578546a19abf9c066953c85283eb4'
WHERE `users`.`id` IN ('1')

    public function resetPassword($token = null)
    {
        $userModel = new UserModel();

        // Validate the token
        $user = $userModel->where('reset_token', $token)->first();
---
SELECT *
FROM `users`
WHERE `reset_token` = '72a133e322e26c94d89db9c6d30fa51d'
 LIMIT 1

    public function updatePassword()
    {
        $token = $this->request->getPost('token');
        $newPassword = $this->request->getPost('new_password');
        $confirmPassword = $this->request->getPost('confirm_password');

        if ($newPassword !== $confirmPassword) {
            return redirect()->back()->with('error', 'Passwords do not match.');
        }

        $userModel = new UserModel();

        // Find the user by the reset token
        $user = $userModel->where('reset_token', $token)->first();

        if (!$user) {
            return redirect()->to('/auth/forgot-password')->with('error', 'Invalid or expired reset token.');
        }

        // Update the password and clear the reset token
        $userModel->update($user['id'], [
            'password' => $newPassword, // Change this to hash password for production
            'reset_token' => null,
        ]);
---
SELECT *
FROM `users`
WHERE `reset_token` = 'c1fab11d44eed2904e601f41887564d3'
 LIMIT 1
UPDATE `users` SET `password` = '11111', `reset_token` = NULL
WHERE `users`.`id` IN ('1')