app/Models/EmployeeModel.php

SELECT `employees`.`id`, `employees`.`name`, `employees`.`position`, `employees`.`department_id`, `employees`.`created_at`, `employees`.`updated_at`, `departments`.`department_name`
FROM `employees`
LEFT JOIN `departments` ON `departments`.`id` = `employees`.`department_id`
---
        public function getEmployees()
        {

            return $this->select('employees.id, employees.name, employees.position, employees.department_id, employees.created_at, employees.updated_at, departments.department_name')
                        ->join('departments', 'departments.id = employees.department_id', 'left')
                        ->findAll();